Revit 2027 API
MEPAnalyticalSegment.GetLossCoefficientOverride Method
 Gets the overridden value of loss coefficient, dimensionless.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetLossCoefficientOverride()
Public Function GetLossCoefficientOverride As Double
public:
double GetLossCoefficientOverride()
member GetLossCoefficientOverride : unit -> float
Return Value
Double
 The overridden value, or 0.0 if the loss efficient is not overridden.
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace